Public Member Functions | List of all members
ACAPI::MEP::UniqueID Class Reference
MEP Element Manager
The MEP unique identifier. More...
#include <MEPUniqueID.hpp>
 Inheritance diagram for ACAPI::MEP::UniqueID:
 Public Member Functions
UniqueID (const GS::Guid &, const API_Token &)
Constructs a UniqueID.
 Public Member Functions inherited from ACAPI::v1::UniqueID
UniqueID (const GS::Guid &, const API_Token &)
Constructs a unique identifier with the given GUID and token.
const GS::Guid &  | GetGuid () const
Returns the unique identifier of the element.
const API_Token &  | GetToken () const
Returns the unique identifier of the AddOn which created this instance.
bool  | operator== (const UniqueID &) const
Comparison operator.
bool  | operator!= (const UniqueID &) const
Comparison operator.
bool  | operator< (const UniqueID &) const
Comparison operator.
Detailed Description
The MEP unique identifier.
Remarks
This class is used to identify MEP elements.